      ******************************************************************
      * Author: FERNANDA PINHEIRO REIS
      * Date: 29/02/2020
      * Purpose: KNOWLEDGE - COLLEGE
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CADAMIGO.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
           INPUT-OUTPUT SECTION.
       DATA DIVISION.


       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       MAIN-PROCEDURE.

            DISPLAY "SISTEMA DE CADASTRO DE AMIGOS"
            DISPLAY "ERASE" AT 0101.

            STOP RUN.
       END PROGRAM CADAMIGO.
